#include "DimMap.h"
#include <cstdio>
#include <string>
#include <locale>
#include <codecvt>

namespace AutoBug
{

/* 2501个常用汉字 */
static const char* chars1 = u8"一乙二十丁厂七卜人入八九几儿了力乃刀又三于干亏士工土才寸下大丈与万上小口巾山千乞川亿个勺久凡及夕丸么广亡门义之尸弓己已子卫也女飞刃习叉马乡丰王井开夫天无元专云扎艺木五支厅不太犬区历尤友匹车巨牙屯比互切瓦止少日中冈贝内水见午牛手毛气升长仁什片仆化仇币仍仅斤爪反介父从今凶分乏公仓月氏勿欠风丹匀乌凤勾文六方火为斗忆订计户认心尺引丑巴孔队办以允予劝双书幻玉刊示末未击打巧正扑扒功扔去甘世古节本术可丙左厉右石布龙平灭轧东卡北占业旧帅归且旦目叶甲申叮电号田由史只央兄叼叫另叨叹四生失禾丘付仗代仙们仪白仔他斥瓜乎丛令用甩印乐句匆册犯外处冬鸟务包饥主市立闪兰半汁汇头汉宁穴它讨写让礼训必议讯记永司尼民出辽奶奴加召皮边发孕圣对台矛纠母幼丝式刑动扛寺吉扣考托老执巩圾扩扫地扬场耳共芒亚芝朽朴机权过臣再协西压厌在有百存而页匠夸夺灰达列死成夹轨邪划迈毕至此贞师尘尖劣光当早吐吓虫曲团同吊吃因吸吗屿帆岁回岂刚则肉网年朱先丢舌竹迁乔伟传乒乓休伍伏优伐延件任伤价份华仰仿伙伪自血向似后行舟全会杀合兆企众爷伞创肌朵杂危旬旨负各名多争色壮冲冰庄庆亦刘齐交次衣产决充妄闭问闯羊并关米灯州汗污江池汤忙兴宇守宅字安讲军许论农讽设访寻那迅尽导异孙阵阳收阶阴防奸如妇好她妈戏羽观欢买红纤级约纪驰巡寿弄麦形进戒吞远违运扶抚坛技坏扰拒找批扯址走抄坝贡攻赤折抓扮抢孝均抛投坟抗坑坊抖护壳志扭块声把报却劫芽花芹芬苍芳严芦劳克苏杆杠杜材村杏极李杨求更束豆两丽医辰励否还歼来连步坚旱盯呈时吴助县里呆园旷围呀吨足邮男困吵串员听吩吹呜吧吼别岗帐财针钉告我乱利秃秀私每兵估体何但伸作伯伶佣低你住位伴身皂佛近彻役返余希坐谷妥含邻岔肝肚肠龟免狂犹角删条卵岛迎饭饮系言冻状亩况床库疗应冷这序辛弃冶忘闲间闷判灶灿弟汪沙汽沃泛沟没沈沉怀忧快完宋宏牢究穷灾良证启评补初社识诉诊词译君灵即层尿尾迟局改张忌际陆阿陈阻附妙妖妨努忍劲鸡驱纯纱纳纲驳纵纷纸纹纺驴纽奉玩环武青责现表规抹拢拔拣担坦押抽拐拖拍者顶拆拥抵拘势抱垃拉拦拌幸招坡披拨择抬其取苦若茂苹苗英范直茄茎茅林枝杯柜析板松枪构杰述枕丧或画卧事刺枣雨卖矿码厕奔奇奋态欧垄妻轰顷转斩轮软到非叔肯齿些虎虏肾贤尚旺具果味昆国昌畅明易昂典固忠咐呼鸣咏呢岸岩帖罗帜岭凯败贩购图钓制知垂牧物乖刮秆和季委佳侍供使例版侄侦侧凭侨佩货依的迫质欣征往爬彼径所舍金命斧爸采受乳贪念贫肤肺肢肿胀朋股肥服胁周昏鱼兔狐忽狗备饰饱饲变京享店夜庙府底剂郊废净盲放刻育闸闹郑券卷单炒炊炕炎炉沫浅法泄河沾泪油泊沿泡注泻泳泥沸波泼泽治怖性怕怜怪学宝宗定宜审宙官空帘实试郎诗肩房诚衬衫视话诞询该详建肃录隶居届刷屈弦承孟孤陕降限妹姑姐姓始驾参艰线练组细驶织终驻驼绍经贯奏春帮珍玻毒型挂封持项垮挎城挠政赴赵挡挺括拴拾挑指垫挣挤拼挖按挥挪某甚革荐巷带草茧茶荒茫荡荣故胡南药标枯柄栋相查柏柳柱柿栏树要咸威歪研砖厘厚砌砍面耐耍牵残殃轻鸦皆背战点临览竖省削尝是盼眨哄显哑冒映星昨畏趴胃贵界虹虾蚁思蚂虽品咽骂哗咱响哈咬咳哪炭峡罚贱贴骨钞钟钢钥钩卸缸拜看矩怎牲选适秒香种秋科重复竿段便俩贷顺修保促侮俭俗俘信皇泉鬼侵追俊盾待律很须叙剑逃食盆胆胜胞胖脉勉狭狮独狡狱狠贸怨急饶蚀饺饼弯将奖哀亭亮度迹庭疮疯疫疤姿亲音帝施闻阀阁差养美姜叛送类迷前首逆总炼炸炮烂剃洁洪洒浇浊洞测洗活派洽染济洋洲浑浓津恒恢恰恼恨举觉宣室宫宪突穿窃客冠语扁袄祖神祝误诱说诵垦退既屋昼费陡眉孩除险院娃姥姨姻娇怒架贺盈勇怠柔垒绑绒结绕骄绘给络骆绝绞统耕耗艳泰珠班素蚕顽盏匪捞栽捕振载赶起盐捎捏埋捉捆捐损都哲逝捡换挽热恐壶挨耻耽恭莲莫荷获晋恶真框桂档桐株桥桃格校核样根索哥速逗栗配翅辱唇夏础破原套逐烈殊顾轿较顿毙致柴桌虑监紧党晒眠晓鸭晃晌晕蚊哨哭恩唤啊唉罢峰圆贼贿钱钳钻铁铃铅缺氧特牺造乘敌秤租积秧秩称秘透笔笑笋债借值倚倾倒倘俱倡候俯倍倦健臭射躬息徒徐舰舱般航途拿爹爱颂翁脆脂胸胳脏胶脑狸狼逢留皱饿恋桨浆衰高席准座脊症病疾疼疲效离唐资凉站剖竞部旁旅畜阅羞瓶拳粉料益兼烤烘烦烧烛烟递涛浙涝酒涉消浩海涂浴浮流润浪浸涨烫涌悟悄悔悦害宽家宵宴宾窄容宰案请朗诸读扇袜袖袍被祥课谁调冤谅谈谊剥恳展剧屑弱陵陶陷陪娱娘通能难预桑绢绣验继球理捧堵描域掩捷排掉堆推掀授教掏掠培接控探据掘职基著勒黄萌萝菌菜萄菊萍菠营械梦梢梅检梳梯桶救副票戚爽聋袭盛雪辅辆虚雀堂常匙晨睁眯眼悬野啦晚啄距跃略蛇累唱患唯崖崭崇圈铜铲银甜梨犁移笨笼笛符第敏做袋悠偿偶偷您售停偏假得衔盘船斜盒鸽悉欲彩领脚脖脸脱象够猜猪猎猫猛馅馆凑减毫麻痒痕廊康庸鹿盗章竟商族旋望率着盖粘粗粒断剪兽清添淋淹渠渐混渔淘液淡深婆梁渗情惜惭悼惧惕惊惨惯寇寄宿窑密谋谎祸谜逮敢屠弹随蛋隆隐婚婶颈绩绪续骑绳维绵绸绿琴斑替款堪搭塔越趁趋超提堤博揭喜插揪搜煮援裁搁搂搅握揉斯期欺联散惹葬葛董葡敬葱落朝辜葵棒棋植森椅椒棵棍棉棚棕惠惑逼厨厦硬确雁殖裂雄暂雅辈悲紫辉敞赏掌晴暑最量喷晶喇遇喊景践跌跑遗蛙蛛蜓喝喂喘喉幅帽赌赔黑铸铺链销锁锄锅锈锋锐短智毯鹅剩稍程稀税筐等筑策筛筒答筋筝傲傅牌堡集焦傍储奥街惩御循艇舒番释禽腊脾腔鲁猾猴然馋装蛮就痛童阔善羡普粪尊道曾焰港湖渣湿温渴滑湾渡游滋溉愤慌惰愧愉慨割寒富窜窝窗遍裕裤裙谢谣谦属屡强粥疏隔隙絮嫂登缎缓编骗缘瑞魂肆摄摸填搏塌鼓摆携搬摇搞塘摊蒜勤鹊蓝墓幕蓬蓄蒙蒸献禁楚想槐榆楼概赖酬感碍碑碎碰碗碌雷零雾雹输督龄鉴睛睡睬鄙愚暖盟歇暗照跨跳跪路跟遣蛾蜂嗓置罪罩错锡锣锤锦键锯矮辞稠愁筹签简毁舅鼠催傻像躲微愈遥腰腥腹腾腿触解酱痰廉新韵意粮数煎塑慈煤煌满漠源滤滥滔溪溜滚滨粱滩慎誉塞谨福群殿辟障嫌嫁叠缝缠静碧璃墙撇嘉摧截誓境摘摔聚蔽慕暮蔑模榴榜榨歌遭酷酿酸磁愿需弊裳颗嗽蜻蜡蝇蜘赚锹锻舞稳算箩管僚鼻魄貌膜膊膀鲜疑馒裹敲豪膏遮腐瘦辣竭端旗精歉熄熔漆漂漫滴演漏慢寨赛察蜜谱嫩翠熊凳骡缩慧撕撒趣趟撑播撞撤增聪鞋蕉蔬横槽樱橡飘醋醉震霉瞒题暴瞎影踢踏踩踪蝶蝴嘱墨镇靠稻黎稿稼箱箭篇僵躺僻德艘膝膛熟摩颜毅糊遵潜潮懂额慰劈操燕薯薪薄颠橘整融醒餐嘴蹄器赠默镜赞篮邀衡膨雕磨凝辨辩糖糕燃澡激懒壁避缴戴擦鞠藏霜霞瞧蹈螺穗繁辫赢糟糠燥臂翼骤鞭覆蹦镰翻鹰警攀蹲颤瓣爆疆壤耀躁嚼嚷籍魔灌蠢霸露囊罐翎";

/* 999个次常用汉字 */
static const char* chars2 = u8"匕刁丐邓冗仑讥夭歹戈乍冯卢凹凸艾夯叭叽囚尔皿矢玄匈邦阱邢凫伦伊仲亥讹讳诀讼讶廷芍芋迄迂夷弛吏吕吁吆驮驯妆屹汛纫旭肋臼卤刨匣兑罕伺佃佑诈诅芭芙芥苇芜芯巫庇庐吠吭吝呐呕呛吮吻吟吱闰妒妓姊狈岖彤屁扳扼抠抡拟抒抑沧沪沥沦沐沛汰汹纬坎坞坠囱囤忱轩灸灼杈杉杖牡汞玖玛韧肛肖肘鸠甸甫邑卦刹刽陌陋郁函侈侥侣侠卑卒卓叁诡苞苟苛茉苫苔茁奈奄弧弥庞帕帚呵哎咖咕咙咆呻咒驹宠宛姆狞岳屉拗拂拇拧拓拄拙泌沽沮泞泣沼绊绅绎坷坤坯坪怯怔贬账贮炬觅枫杭枚枢枉玫昙昔氓祈殴瓮肮肪肴歧秉疙疚矾衩虱疟忿氛陨勃勋俄侯俐俏诲诫诬茬茴荤荠荚荆荔荞茸茵荧徊逊契奕哆咧咪哟咨骇闺闽宦娄娜姚狰峦屏屎饵拱拷拭挟拯洛洼涎垛垢恍恃恬恤幽贰轴飒烁炫毡柑枷柬柠柒栅栈氢昧昵昭祠泵玷玲珊胧胚胎秕钝钙钧钠钮钦盅盹鸥砂砚蚤虐籽衍韭凌凄剔匿郭卿俺倔诽诺谆荸莱莉莽莺莹逞逛哺哼唧唠哩唆哮唁骏娩峻峭馁捌挫捣捍捅捂涤涡涣涧浦涩涕埃埂圃悍悯贾赁赂赃羔殉烙梆桦栖栓桅桩氨挚殷瓷斋恕胯脓脐胰秦秫钾铆疹鸵鸯鸳砾砰砸祟畔窍袒蚌蚪蚣蚜蚓耿聂耸舀耙耘紊笆酌豹豺颁袁衷乾厢兜匾隅凰冕勘傀偎谍谓谐谚谒菲菇菱菩萨萎萧萤徘徙巢逻逸尉奢庵庶啡唬啃啰啤啥唾啸阐阎寂娶婉婴猖崩崔崎彪彬掺捶措掸掂捺捻掐掖掷淳淀涵淮淑涮淌淆涯淫淤渊绷绰综绽缀埠堕悴惦惋赊烹焊焕梗梭梧敛晦晤祷琅琉琐曹曼脯秽秸铛铐铝铭铣铡盔眷眶痊鸿硅硕矫祭畦窒裆袱蛆蛉蚯蛀聊翎舶舵舷笙笤赦麸躯酗酝趾颅颇衅隘募凿谤蒂葫蒋遏遂逾奠喳啼喧喻骚寓媒媚婿猬猩嵌彭壹搀揣搓揩揽搔揖揍渤溅溃渺湃湘滞缔缆缕缅堰愕惶赐赋赎焙椎棺棘榔棱棠椭椰犀牍敦氮氯晾晰掰琳琼琢韩惫腌腕腋锉锌竣痘痪痢鹃甥硫硝畴窖窘蛤蛔蜒粟粤翘翔筏酣酥跋跛雳雇鼎黍颊焚剿谬蓖蒿蒲蓉廓幌嗤嗜嗦嗡嗅寞寝嫉媳猿馏馍搪漓溺溶溯溢滓缤缚煞辐辑斟椿楷榄楞楣楔暇瑰瑟腻腮腺稚锭锚锰锨锥睹瞄睦痹痴鹏鹉碘碉硼禀署畸窟窥褂裸蜀蜕蜗蜈蛹聘肄筷誊酪跺跷靖雏靶靴魁颓颖频衙兢隧僧谭蔼蔓蔫蔚箫蔗幔嘀嘁寡寥嫡彰漱漩漾缨墅慷孵赘熬熙熏辖辕榕榛摹镀瘩瘟碴碟碱碳褐褪蝉舆粹舔箍箕赫酵踊雌凛谴蕊蕴幢嘲嘿嘹嘶嬉履撮撩撵撬擒撰澳澈澄澜潦潘澎潭缭墩懊憔憎樊橄樟敷憋憨膘稽镐镊瘪瘤瘫鹤磅磕碾褥蝙蝠蝗蝌蝎褒翩篓豌豫醇鲫鲤鞍冀儒蕾薇薛噩噪撼擂擅濒缰憾懈辙燎橙橱擎膳瓢穆瘸瘾鹦窿蟆螟螃糙翰篡篙篱篷踱蹂鲸霍霎黔儡藐徽嚎壕懦赡檩檬檀檐曙朦臊臀爵镣瞪瞭瞬瞳癌礁磷蟥蟀蟋糜簇豁蹋鳄魏藕藤嚣瀑戳瞻癞襟璧鳍蘑藻攒孽癣蟹簸簿蹭蹬靡鳖羹巍攘蠕糯譬鳞鬓躏霹髓蘸瓤镶矗";

/*******************************************
 * @brief 获取一个全局公共实例
 * @return 对象实例
 * ****************************************/
DimMap& instance()
{
    static DimMap dimMap;
    return dimMap;
}

DimMap::DimMap()
{
    /* 构建汉字和超空间维度的映射关系 */
    int dim = 0;
    std::wstring uft8Str = std::wstring_convert<std::codecvt_utf8<wchar_t>>().from_bytes(chars1);
    for(wchar_t ch : uft8Str)
    {
        m_dimMap[ch] = dim;
        m_wordMap[dim] = ch;
        dim++;
    }

    uft8Str = std::wstring_convert<std::codecvt_utf8<wchar_t>>().from_bytes(chars2);
    for(wchar_t ch : uft8Str)
    {
        m_dimMap[ch] = dim;
        m_wordMap[dim] = ch;
        dim++;
    }
}

/*******************************************
 * @brief 输入一个汉字,获取对应的维度
 * @param ch 输入的汉字
 * @return 对应的维度,如果未收录该汉字则返回-1
 * ****************************************/
int DimMap::dim(wchar_t ch)
{
    if (m_dimMap.find(ch) == m_dimMap.end())
        return -1;
    return m_dimMap[ch];
}

/*******************************************
 * @brief 输入一个维度,获取对应的汉字
 * @param ch 输入的维度
 * @return 对应的汉字
 * ****************************************/
wchar_t DimMap::word(int dim)
{
    if (m_wordMap.find(dim) == m_wordMap.end())
        return L'\0';
    return m_wordMap[dim];
}

/*******************************************
 * @brief 获取超空间总维数
 * @return 超空间总维数
 * ****************************************/
int DimMap::dims()
{
    return m_dimMap.size();
}


}; // namespace AutoBug